Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cognito_user_pool.this will be updated in-place
~ resource "aws_cognito_user_pool" "this" {
        id                         = "us-east-2_9oCzdeOZF"
        name                       = "wrestleutopia-user-pool"
        tags                       = {}
        # (18 unchanged attributes hidden)

      ~ account_recovery_setting {
          - recovery_mechanism {
              - name     = "verified_phone_number" -> null
              - priority = 2 -> null
            }

            # (1 unchanged block hidden)
        }

      ~ email_configuration {
          + from_email_address     = "Wrestle Utopia <no-reply@feedutopia.com>"
          ~ source_arn             = "arn:aws:ses:us-east-2:390402544450:identity/noreply@feedutopia.com" -> "arn:aws:ses:us-east-2:390402544450:identity/feedutopia.com"
            # (3 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # aws_iam_policy.cognito_cleanup_policy will be created
+ resource "aws_iam_policy" "cognito_cleanup_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "List and delete UNCONFIRMED Cognito users"
      + id               = (known after apply)
      + name             = "wrestleutopia-cognito-cleanup-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cognito-idp:ListUsers",
                          + "cognito-idp:AdminDeleteUser",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cognito-idp:us-east-2:390402544450:userpool/us-east-2_9oCzdeOZF"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_role_policy_attachment.cognito_cleanup_attach will be created
+ resource "aws_iam_role_policy_attachment" "cognito_cleanup_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia-cognito-cleanup-role"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```